### Turtle Graphics

In [ ]:
#Design a spiral star
import turtle as t
a1=t.Turtle()
a1.pencolor('violet')##change the color of pen
for i in range (40):
    a1.forward(i*10)
    a1.left(144)
t.done()

In [ ]:
# design a spiral square
import turtle as t
a1=t.Turtle()
a1.pencolor('violet')
for i in range (200):
    a1.forward(i)
    a1.left(91)
t.done()

In [ ]:
#Design a Hexagon
from turtle import *
pencolor('red')
colors=['blue','green','orange','violet','purple','yellow']
for i in range (360):
    pencolor(colors[i%6])
    width(i/100+1)
    forward(i)
    left(59)

In [ ]:
# Creating a circle
from turtle import *
pensize(20)
pencolor('violet')
fillcolor('red')
begin_fill()
circle(100)
end_fill()

In [ ]:
#Design spiral circle
from turtle import *
pensize(3)
pencolor('skyblue')
for i in range (200):
    circle(10*i)

In [ ]:
# design spiral circle
from turtle import *
pensize(3)
pencolor('purple')
for i in range (100):
    circle(10+i,45)

In [ ]:
#Design a circle over a circle
from turtle import *
pensize(3)
pencolor('green')
colors=['blue','green','red','yellow']
for i in range (30):
    pencolor(colors[i%4])
    circle(10*i)
    up()
    sety((10*i)*(-1))
    down()

In [ ]:
#Design olympic logo
from turtle import *
pensize(6)
r1=['blue','black','red']
for i in range (3):
    penup()
    pencolor(r1[i%3])
    goto(i*100,0)
    pendown()
    circle(45)
r2=["","yellow","","green"]
for i in range (1,4,2):
    penup()
    pencolor(r2[i])
    goto(i*55,-55)
    pendown()
    circle(50)

In [ ]:
#Design Audi logo
from turtle import *
pensize(6)
for i in range(4):
    penup()
    goto(i*70,0)
    pendown()
    circle(50)

## Idiomatic Python
- trnsformation code into beautiful idiomatic python
- replaces traditional index manipulation with python code looping idioms

In [1]:
# looping over a range of numbers
for i in [0,1,2,3,4,5]:
    print(i**2,end=" ")
print()
#pythinic way
for i in range(6):
    print(i**2,end=" ")

0 1 4 9 16 25
0 1 4 9 16 25

In [2]:
#looping over the collection (list)
li=[1,2,3,4,5]
for i in range (len(li)):
    print(li[i],end= " ")
print()
#pythinic way
for i in li:
    print(i,end=" ")

1 2 3 4 5
1 2 3 4 5

In [4]:
# looping from bacward s
li=[1,2,3,4,5]
for i in range(len(li)-1,-1,-1):
    print(li[i],end=" ")
print()
#pythinic way
for i in reversed(li):
    print(i,end=" ")

5 4 3 2 1
5 4 3 2 1

In [6]:
#looping over the collection with index
li=[1,2,3,4,5]
for i in range(len(li)):
    print(i,'--->',li[i])
print()
#pythonic way
for i,a in enumerate(li):
    print(i,'--->',a)

0 ---> 1
1 ---> 2
2 ---> 3
3 ---> 4
4 ---> 5

0 ---> 1
1 ---> 2
2 ---> 3
3 ---> 4
4 ---> 5

In [8]:
#loping over two collectons
li=[1,2,3,4,5]
a=[1,2,3,4,5,6,8]
n=min(len(li),len(a))
for i in range (n):
    print(li[i],' ',a[i])
print()
#pythonic way
for i,a in zip (li,a):
    print(i,' ',a)

1   1
2   2
3   3
4   4
5   5

1   1
2   2
3   3
4   4
5   5

In [9]:
#looping in sorted order
li=[8,1,25,34,9,2]
for i in sorted (li):
    print(i,end=" ")
print()
for i in sorted(li,reverse=True):
    print(i,end=" ")

1 2 8 9 25 34
34 25 9 8 2 1

In [17]:
#dictionary
d={"name":"gitam","email":"gitam@gmail.com","address":"vizag"}
for k in d:
    print(k,end=" ")
print()

name email address

In [15]:
for k in d.keys():
    if k.startswith('a'):
        del d[k]
print(d)

{'name': 'gitam', 'email': 'gitam@gmail.com'}

In [19]:
for k in d.values():
    print(k,end=" ")

gitam gitam@gmail.com vizag

### List comprehension

In [2]:
#traditional approach
li=[]
for i in range (10):
    a=i**2
    li.append(a)
print(sum(li))
print()
#pythonic way
print(sum(i**2 for i in range (10)))

285

285

In [3]:
li=[]
for i in range(10):
    li.append(i**2)
li

[0, 1, 4, 9, 16, 25, 36, 49, 64, 81]

In [4]:
com_list=[i**2 for i in range (10)]
com_list

[0, 1, 4, 9, 16, 25, 36, 49, 64, 81]

### Lambda functions
- anonymous functions means that a function is without a name
- any lambda function on python will be defined with lambda
- syntax: lambda arg:expression

In [5]:
def square(n):
    return n*n
square(10)

100

In [6]:
a=lambda x:x*x
print(a(10))

100

## Use of lambda with filter

In [8]:
def filterList(li):
    a=[]
    for i in li:
        if i%2==0:
            a.append(i)
    return a
li=[1,2,3,4,5,6,7,8]
filterList(li)

[2, 4, 6, 8]

In [9]:
l=[1,2,3,4,5,6,7,8]
lli=list(filter(lambda x: (x%2==0),l))
print(lli)

[2, 4, 6, 8]

## Lambda with map
- map() in python takes in a function and list as argument

In [10]:
def sl(l):
    a=[]
    for i in l:
        a.append(i*2)
    return a
l=[1,2,3,4,5,6,7,8]
sl(l)

[2, 4, 6, 8, 10, 12, 14, 16]

In [11]:
l=[1,2,3,4,5,6,7,8]
map_list=list(map(lambda x : x*2,l))
print(map_list)

[2, 4, 6, 8, 10, 12, 14, 16]

## Lambda with Reduce

In [12]:
def sumList(li):
    s=0
    for i in li:
        s+=i
    return s
li=[1,2,3,4,5,6,7,8]
sumList(li)

36

In [13]:
from functools import reduce
li=[1,2,3,4,5,6,7,8]
s=reduce((lambda x,y:x+y),li)
print(s)

36

### Standard Packages
- Pandas,Numpy and Matplitlib

# Pandas
## Use cases
- Data cleaning
- Data Transformation
- Data Analysis
## Notations
- Series
       - a series is a one dimensional object that can hold int,float
- DataFrames

In [133]:
import pandas as pd
internal1= {'s1':35,'s2':35,'s3':35}
internal2= {'s1':36,'s2':325,'s3':3225}
internal1 = pd.Series(internal1)
internal2 = pd.Series(internal2)
print(internal1)
print(internal2)

s1    35
s2    35
s3    35
dtype: int64
s1      36
s2     325
s3    3225
dtype: int64

In [52]:
final={'internal1':internal1,'internal2':internal2}
final= pd.DataFrame(final)
print(final)
print(type(final))

    internal1  internal2
s1         35         36
s2         35        325
s3         35       3225
<class 'pandas.core.frame.DataFrame'>

In [53]:
final.columns

Index(['internal1', 'internal2'], dtype='object')

In [54]:
final.values

array([[  35,   36],
       [  35,  325],
       [  35, 3225]], dtype=int64)

In [55]:
final.values[2]#To display Values of a particular row

array([  35, 3225], dtype=int64)

In [56]:
final.values[2][0]#displays elment at 2nd row and 1st column

35

In [57]:
final.values[2][0]=10000#To update dataframes or to update a  particular element of a dataset

In [59]:
final.values

array([[   35,    36],
       [   35,   325],
       [10000,  3225]], dtype=int64)

In [63]:
for row in final.values:
    print('internal1 -',row[0],'internal2 -',row[1])

internal1 - 35 internal2 - 36
internal1 - 35 internal2 - 325
internal1 - 10000 internal2 - 3225

In [64]:
final.loc['s4']=[20,18]#insert the new record in the data frame
final

    internal1  internal2
s1         35         36
s2         35        325
s3      10000       3225
s4         20         18

In [66]:
final.values[2] = [12,33]
final

    internal1  internal2
s1         35         36
s2         35        325
s3         12         33
s4         20         18

In [67]:
pwd

'C:\\Users\\hp\\Desktop\\Problem solving and programming'

In [81]:
filepath = 'Data files/Income.csv'
def readCsvData(fileopath):
    return pd.read_csv(filepath)
df=readCsvData(filepath)
df

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,62993,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [92]:
a=pd.read_csv('C://Users//hp//Desktop//Problem solving and programming//Income.csv')
a

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,62993,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [85]:
df.values[0,10]#TO PRINT 2013 DATA OF ALABAMA

41381

In [86]:
df.values[0,-1]#2013 DATA IS AT LAST SO WE CAN USE -1

41381

In [88]:
for row in df.values:#prints the 2013 data of all the rows
    print(row[1],':',row[-1])

Alabama : 41381
Alaska : 61137
Arizona : 50602
Arkansas : 39919
California : 57528

In [90]:
df.values[0,10]=2000000

In [91]:
df

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,62993,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [97]:
#Average income of california
s=0
for i in range (2,11):
    s+=df.values[4][i]
print(s//len(df.values[4][2:]))# to know the number of years of california

55350

In [113]:
# function to print columns in the list
def printDataFramecolumns(df):
    li=[]
    columns=df.columns
    for i in columns:
        li.append(i)
    return li
a=printDataFramecolumns(df)
print(a)

['GEOID', 'State', '2005', '2006', '2007', '2008', '2009', '2010', '2011', '2012', '2013']

In [135]:
df=pd.read_csv('F:/data science/RegularSeasonCompactResults.csv')

In [141]:
df

        Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
0         1985      20   1228      81   1328      64    N      0
1         1985      25   1106      77   1354      70    H      0
2         1985      25   1112      63   1223      56    H      0
3         1985      25   1165      70   1432      54    H      0
4         1985      25   1192      86   1447      74    H      0
5         1985      25   1218      79   1337      78    H      0
6         1985      25   1228      64   1226      44    N      0
7         1985      25   1242      58   1268      56    N      0
8         1985      25   1260      98   1133      80    H      0
9         1985      25   1305      97   1424      89    H      0
10        1985      25   1307     103   1288      71    H      0
11        1985      25   1344      75   1438      71    N      0
12        1985      25   1374      91   1411      72    H      0
13        1985      25   1412      70   1397      65    N      0
14        1985      25   1417      87   1225      58    H      0
15        1985      26   1116      65   1368      62    H      0
16        1985      26   1120      92   1391      50    H      0
17        1985      26   1135      65   1306      60    A      0
18        1985      26   1143      58   1388      53    H      0
19        1985      26   1153      50   1184      48    H      0
20        1985      26   1165      47   1159      40    A      0
21        1985      26   1171      55   1216      52    H      0
22        1985      26   1173      76   1134      56    H      0
23        1985      26   1177      59   1296      58    H      0
24        1985      26   1193      79   1265      76    A      0
25        1985      26   1196     106   1416      55    H      0
26        1985      26   1206      95   1137      77    H      0
27        1985      26   1210      79   1149      66    H      0
28        1985      26   1211      64   1102      59    A      0
29        1985      26   1234      76   1114      47    H      0
...        ...     ...    ...     ...    ...     ...  ...    ...
145259    2016     130   1452      69   1328      67    N      0
145260    2016     131   1114      72   1418      65    N      0
145261    2016     131   1138      64   1103      61    N      0
145262    2016     131   1163      77   1396      62    N      0
145263    2016     131   1167      57   1308      54    N      0
145264    2016     131   1201      68   1361      63    N      0
145265    2016     131   1214      81   1354      69    N      0
145266    2016     131   1218      64   1253      60    N      0
145267    2016     131   1242      81   1452      71    N      0
145268    2016     131   1246      93   1208      80    N      0
145269    2016     131   1272      74   1408      54    N      0
145270    2016     131   1277      64   1268      61    N      0
145271    2016     131   1292      55   1330      53    N      0
145272    2016     131   1314      61   1438      57    N      0
145273    2016     131   1332      88   1428      57    N      0
145274    2016     131   1345      76   1276      59    N      0
145275    2016     131   1371      69   1437      67    N      0
145276    2016     131   1372      82   1394      60    N      0
145277    2016     131   1380      54   1238      53    N      0
145278    2016     131   1386      82   1173      79    N      0
145279    2016     131   1392      80   1436      74    H      0
145280    2016     131   1401      71   1261      38    N      0
145281    2016     131   1419      82   1426      71    N      0
145282    2016     131   1433      76   1172      54    N      0
145283    2016     131   1451      62   1285      59    N      0
145284    2016     132   1114      70   1419      50    N      0
145285    2016     132   1163      72   1272      58    N      0
145286    2016     132   1246      82   1401      77    N      1
145287    2016     132   1277      66   1345      62    N      0
145288    2016     132   1386      87   1433      74    N      0

[145289 rows x 8 columns]

In [136]:
df.shape

(145289, 8)

In [137]:
print(df.head(5))# prints first 5 rows
df.head(10)

   Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
0    1985      20   1228      81   1328      64    N      0
1    1985      25   1106      77   1354      70    H      0
2    1985      25   1112      63   1223      56    H      0
3    1985      25   1165      70   1432      54    H      0
4    1985      25   1192      86   1447      74    H      0

   Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
0    1985      20   1228      81   1328      64    N      0
1    1985      25   1106      77   1354      70    H      0
2    1985      25   1112      63   1223      56    H      0
3    1985      25   1165      70   1432      54    H      0
4    1985      25   1192      86   1447      74    H      0
5    1985      25   1218      79   1337      78    H      0
6    1985      25   1228      64   1226      44    N      0
7    1985      25   1242      58   1268      56    N      0
8    1985      25   1260      98   1133      80    H      0
9    1985      25   1305      97   1424      89    H      0

In [138]:
print(df.tail())
df.tail(10)

        Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
145284    2016     132   1114      70   1419      50    N      0
145285    2016     132   1163      72   1272      58    N      0
145286    2016     132   1246      82   1401      77    N      1
145287    2016     132   1277      66   1345      62    N      0
145288    2016     132   1386      87   1433      74    N      0

        Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
145279    2016     131   1392      80   1436      74    H      0
145280    2016     131   1401      71   1261      38    N      0
145281    2016     131   1419      82   1426      71    N      0
145282    2016     131   1433      76   1172      54    N      0
145283    2016     131   1451      62   1285      59    N      0
145284    2016     132   1114      70   1419      50    N      0
145285    2016     132   1163      72   1272      58    N      0
145286    2016     132   1246      82   1401      77    N      1
145287    2016     132   1277      66   1345      62    N      0
145288    2016     132   1386      87   1433      74    N      0

In [139]:
df.columns.tolist()# converts column names into list

['Season', 'Daynum', 'Wteam', 'Wscore', 'Lteam', 'Lscore', 'Wloc', 'Numot']

In [144]:
df.describe()

,Season,Daynum,Wteam,Wscore,Lteam,Lscore,Numot
count,145289.000000,145289.000000,145289.000000,145289.000000,145289.000000,145289.000000,145289.000000
mean,2001.574834,75.223816,1286.720646,76.600321,1282.864064,64.497009,0.044387
std,9.233342,33.287418,104.570275,12.173033,104.829234,11.380625,0.247819
min,1985.000000,0.000000,1101.000000,34.000000,1101.000000,20.000000,0.000000
25%,1994.000000,47.000000,1198.000000,68.000000,1191.000000,57.000000,0.000000
50%,2002.000000,78.000000,1284.000000,76.000000,1280.000000,64.000000,0.000000
75%,2010.000000,103.000000,1379.000000,84.000000,1375.000000,72.000000,0.000000
max,2016.000000,132.000000,1464.000000,186.000000,1464.000000,150.000000,6.000000

In [146]:
df.max()#prints the max value

Season    2016
Daynum     132
Wteam     1464
Wscore     186
Lteam     1464
Lscore     150
Wloc         N
Numot        6
dtype: object

## Pandas does not contain avg function

In [147]:
df['Lteam'].max()# gives the minimum value in the lteam

1464

In [150]:
df['Numot'].min()# gives the maximum value in the Numot

0

In [156]:
q=df['Numot'].sum()
a=q/df.shape[0]
a

0.04438739340211578

In [160]:
df.loc[:3]

   Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
0    1985      20   1228      81   1328      64    N      0
1    1985      25   1106      77   1354      70    H      0
2    1985      25   1112      63   1223      56    H      0
3    1985      25   1165      70   1432      54    H      0

In [161]:
df.iloc[:3]

   Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
0    1985      20   1228      81   1328      64    N      0
1    1985      25   1106      77   1354      70    H      0
2    1985      25   1112      63   1223      56    H      0

In [171]:
a=df.sort_values('Lscore').head()
a['Lscore']

100027    20
49310     21
89021     21
85042     22
103660    22
Name: Lscore, dtype: int64

In [165]:
df.sort_values('Lscore').tail()

       Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
77873    2003     110   1383     142   1254     140    H      2
24970    1991      68   1258     186   1109     140    H      0
22074    1990      96   1261     148   1258     141    H      0
16853    1989      68   1258     162   1109     144    A      0
17867    1989      92   1258     181   1109     150    H      0

In [174]:
q=df.sort_values('Lscore').tail()
q['Lscore'].mean()# mean of last 5 lscores

143.0

In [183]:
# FILTER THE RECORDS BASED ON CONDITION
df[(df['Wscore']>150)]#prints the records with wscore >150 according to order

       Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
5269     1986      75   1258     151   1109     107    H      0
12046    1988      40   1328     152   1147      84    H      0
12355    1988      52   1328     151   1173      99    N      0
16040    1989      40   1328     152   1331     122    H      0
16853    1989      68   1258     162   1109     144    A      0
17867    1989      92   1258     181   1109     150    H      0
19653    1990      30   1328     173   1109     101    H      0
19971    1990      38   1258     152   1109     137    A      0
20022    1990      40   1116     166   1109     101    H      0
22145    1990      97   1258     157   1362     115    H      0
23582    1991      26   1318     152   1258     123    N      0
24341    1991      47   1328     172   1258     112    H      0
24970    1991      68   1258     186   1109     140    H      0
25656    1991      84   1106     151   1212      97    H      0
28687    1992      54   1261     159   1319      86    H      0
35023    1993     112   1380     155   1341      91    A      0
40060    1995      32   1375     156   1341     114    H      0
52600    1998      33   1395     153   1410      87    H      0

In [186]:
df[(df['Wscore']>150) & (df['Daynum']>100)]#prints the records with wscore >150 and daynum >100

       Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
35023    1993     112   1380     155   1341      91    A      0